import i18n from "@locale";
import { toAboutApp, toChangePassword, toContactUS, toMyProfile, toShowLang } from "@routes";

export const intros = [
    {
        title: i18n.t('page1-title'),
        description: i18n.t('page1-desc'),
        image: 'https://i.pinimg.com/564x/bb/b3/7e/bbb37ecf785a17aef0f7b0ab4db025a2.jpg'
    },
    {
        title: i18n.t('page2-title'),
        description: i18n.t('page2-desc'),
        image: 'https://media.istockphoto.com/vectors/smartphone-online-shopping-concepts-vector-id1213907347?k=20&m=1213907347&s=612x612&w=0&h=vFwVURXWhYaxpxznUpm6u-8e_trufdbGhqc2XIqy6Ug='
    },
    {
        title: i18n.t('page3-title'),
        description: i18n.t('page3-desc'),
        image: 'https://i.pinimg.com/564x/b9/2d/a5/b92da5d76b2c80e49833ef7c32ed88bc.jpg'
    },

]

export const Department = [
    { id: 1, name: 'محل ملابس', },
    { id: 2, name: 'محل حلاويات', },
    { id: 3, name: 'مطاعم', },
]
export const DepartmentType = [
    { id: 1, name: 'فستان' },
    { id: 2, name: ' قميص', },
    { id: 3, name: 'بنطلون', },
]
export const homeGallery = [
    { image: 'https://i.pinimg.com/564x/02/d9/d7/02d9d7e28f1ec10aaa1470f18ec5bcd8.jpg' },
    { image: 'https://i.pinimg.com/564x/bb/85/5d/bb855d5df889008a7da14d599675149d.jpg' },
    { image: 'https://i.pinimg.com/564x/7f/ae/06/7fae0622c53fb138fc4e48c74b9aec95.jpg' },
    { image: 'https://i.pinimg.com/564x/45/c2/0c/45c20cdf128be1113ad80cc441952ab4.jpg' },
    { image: "https://i.pinimg.com/564x/01/f1/56/01f156ae8d1bf8ade50db22d1bb4b18e.jpg" }


]

export const Products = [
    { title: 'فساتين', price: '100 SAR', rate: 5, image: 'https://i.pinimg.com/564x/3a/90/8e/3a908ed089ab733cd6bba849f61a9c80.jpg', productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'كوتشي', price: '120 SAR', rate: 4, image: 'https://i.pinimg.com/564x/8d/44/da/8d44da64868793261e159da724cf0f57.jpg', productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'تيشرتات', price: '340 SAR', rate: 5, image: 'https://i.pinimg.com/564x/a0/4f/01/a04f01eaebbe72a22573d49cf1517128.jpg', productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'نظارات', price: '500 SAR', rate: 3, image: 'https://i.pinimg.com/564x/61/de/f8/61def81374050afe50c3d9cc615311d6.jpg', productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'لبس خروج', price: '100 SAR', rate: 2, image: "https://i.pinimg.com/564x/ad/1d/61/ad1d61e25be7d12ac830bc6a6c2e09ff.jpg", productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'لبس سينيه', price: '100 SAR', rate: 2, image: "https://i.pinimg.com/564x/db/3b/a8/db3ba826023b5793746f36d9d4541cd7.jpg", productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'شنطه', price: '250 SAR', rate: 5, image: 'https://i.pinimg.com/564x/73/1a/fe/731afe1dd11c6b9c6eff5213d5237523.jpg', productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'فساتين', price: '100 SAR', rate: 5, image: 'https://i.pinimg.com/564x/3a/90/8e/3a908ed089ab733cd6bba849f61a9c80.jpg', productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'كوتشي', price: '120 SAR', rate: 4, image: 'https://i.pinimg.com/564x/8d/44/da/8d44da64868793261e159da724cf0f57.jpg', productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'تيشرتات', price: '340 SAR', rate: 5, image: 'https://i.pinimg.com/564x/a0/4f/01/a04f01eaebbe72a22573d49cf1517128.jpg', productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'نظارات', price: '500 SAR', rate: 3, image: 'https://i.pinimg.com/564x/61/de/f8/61def81374050afe50c3d9cc615311d6.jpg', productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'لبس خروج', price: '100 SAR', rate: 2, image: "https://i.pinimg.com/564x/ad/1d/61/ad1d61e25be7d12ac830bc6a6c2e09ff.jpg", productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'لبس سينيه', price: '100 SAR', rate: 2, image: "https://i.pinimg.com/564x/db/3b/a8/db3ba826023b5793746f36d9d4541cd7.jpg", productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },
    { title: 'شنطه', price: '250 SAR', rate: 5, image: 'https://i.pinimg.com/564x/73/1a/fe/731afe1dd11c6b9c6eff5213d5237523.jpg', productDesc: "يتطلب إنشاء خط الملابس الخاص بك الكثير من العمل أكثر من طباعة قميص أو اثنين وبيعها عبر الإنترنت. ستحتاج إلى خطة عمل ، وفكرة عمل شاملة ، وخطة خطوة بخطوة لكيفية إنجاح أعمالك التجارية أولا ، تحتاج إلى اتخاذ قرار بشأن المنتجات التي تريد بيعها. هناك احتمالات إذا كنت تعيش في النهاية حلمك وإطلاق خط الموضة. سيكون لديك فكرة تقريبية عما تريد إنشاءه.    " },


]

export const ordersStore = {
    "new": [
        { title: 'فساتين', price: '100 SAR', rate: 5, image: 'https://i.pinimg.com/564x/3a/90/8e/3a908ed089ab733cd6bba849f61a9c80.jpg' },
        { title: 'كوتشي', price: '120 SAR', rate: 4, image: 'https://i.pinimg.com/564x/8d/44/da/8d44da64868793261e159da724cf0f57.jpg' },
        { title: 'تيشرتات', price: '340 SAR', rate: 5, image: 'https://i.pinimg.com/564x/a0/4f/01/a04f01eaebbe72a22573d49cf1517128.jpg' },
        { title: 'نظارات', price: '500 SAR', rate: 3, image: 'https://i.pinimg.com/564x/61/de/f8/61def81374050afe50c3d9cc615311d6.jpg' },
        { title: 'لبس خروج', price: '100 SAR', rate: 2, image: "https://i.pinimg.com/564x/ad/1d/61/ad1d61e25be7d12ac830bc6a6c2e09ff.jpg" },
        { title: 'لبس سينيه', price: '100 SAR', rate: 2, image: "https://i.pinimg.com/564x/db/3b/a8/db3ba826023b5793746f36d9d4541cd7.jpg" },
        { title: 'تيشرتات', price: '340 SAR', rate: 5, image: 'https://i.pinimg.com/564x/a0/4f/01/a04f01eaebbe72a22573d49cf1517128.jpg' },

    ],
    "finished": [
        { title: 'فساتين', price: '100 SAR', rate: 5, image: 'https://i.pinimg.com/564x/3a/90/8e/3a908ed089ab733cd6bba849f61a9c80.jpg' },
        { title: 'كوتشي', price: '120 SAR', rate: 4, image: 'https://i.pinimg.com/564x/8d/44/da/8d44da64868793261e159da724cf0f57.jpg' },
        { title: 'تيشرتات', price: '340 SAR', rate: 5, image: 'https://i.pinimg.com/564x/a0/4f/01/a04f01eaebbe72a22573d49cf1517128.jpg' },
        { title: 'نظارات', price: '500 SAR', rate: 3, image: 'https://i.pinimg.com/564x/61/de/f8/61def81374050afe50c3d9cc615311d6.jpg' },
        { title: 'لبس خروج', price: '100 SAR', rate: 2, image: "https://i.pinimg.com/564x/ad/1d/61/ad1d61e25be7d12ac830bc6a6c2e09ff.jpg" },
        { title: 'لبس سينيه', price: '100 SAR', rate: 2, image: "https://i.pinimg.com/564x/db/3b/a8/db3ba826023b5793746f36d9d4541cd7.jpg" },
        { title: 'تيشرتات', price: '340 SAR', rate: 5, image: 'https://i.pinimg.com/564x/a0/4f/01/a04f01eaebbe72a22573d49cf1517128.jpg' },

    ]
}


export const SettingsData = [
    { name: 'myProfile', onPress: () => toMyProfile() },
    { name: 'changePassword', onPress: () => toChangePassword() },
    { name: 'aboutApp', onPress: () => toAboutApp() },
    { name: 'ContactUs', onPress: () => toContactUS() },
    { name: 'chooseLang', onPress: () => toShowLang() },
    { name: 'shareApp', onPress: () => { } },
    { name: 'logout', onPress: () => { } },
]